app/Tag.php

    public function getPaginateByLimit(int $limit_count = 10)
    {
        // updated_atで降順に並べたあと、limitで件数制限をかける
        return $this->orderBy('updated_at', 'DESC')->paginate($limit_count);
---
select * from `tags` order by `updated_at` desc limit 5 offset 0
select count(*) as aggregate from `tags`