app/Http/Controllers/DishController.php

select * from `posts` where `posts`.`dish_id` = 76 and `posts`.`dish_id` is not null
---
    public function searchpost(Dish $dish)
    {
        $posts=$dish->posts()->orderBy('updated_at', 'DESC')->get();
        // $posts=$dish->posts()->orderBy('updated_at', 'DESC')->paginate(10);
        return view('posts/search_post')->with(['dish' => $dish, 'posts' => $posts ]);