app/Http/Controllers/PostController.php

insert into `posts` (`url`, `dish_id`, `updated_at`, `created_at`) values ('https://cookpad.com/recipe/1467727', '76', '2022-06-14 01:13:44', '2022-06-14 01:13:44')
---
    public function storeurl(Post $post, PosturlRequest $request)
    {
        $input = $request['post'];
        $post->fill($input)->save();