app/Http/Controllers/TagController.php

select * from `dishes` where `dishes`.`tag_id` = 76 and `dishes`.`tag_id` is not null
---
    public function selectdish(Tag $tag)
    {
        //$dishes=$tag->dishes()->paginate(5);
        $dishes=$tag->dishes()->get();

select * from `dishes` where `dishes`.`tag_id` = 75 and `dishes`.`tag_id` is not null
---
    public function createdish(Tag $tag)
    {
        return view('dishes/create_dish')->with(['tag' => $tag ]);